# CeramicPattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ceramic..::..CeramicPattern Property
Ceramic Class See Also
---
The property labeled "Relief Pattern" from the "Ceramic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string CeramicPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeramicPattern As String
	Get
```

Visual C++
---
```text
public:
static property String^ CeramicPattern {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicPatternType".
# See Also
Ceramic Class
Autodesk.Revit.DB.Visual Namespace